In [97]:
import numpy as np
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [98]:
titles = pd.read_csv('_data/Pandas_exercise/imdb_pandas/titles.csv', index_col=None)
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [99]:
cast = pd.read_csv('_data/Pandas_exercise/imdb_pandas/cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### What are the ten most common movie names of all time?

In [100]:
titles['title'].value_counts().head(5)

title
Hamlet          18
Carmen          16
Macbeth         15
The Outsider    12
Maya            12
Name: count, dtype: int64

### Which three years in the 1930s saw the most films released?

In [101]:
titles_1930s = titles[titles['year'].between(1930, 1940, inclusive='left')]
titles_1930s.groupby('year').count().sort_values(by='title', ascending=False).head(3)

      title
year
1937   1196
1936   1138
1938   1129

### Count the number of films that have been released in each decade over the history of cinema.

In [122]:
titles['decade'] = titles['year'].apply(lambda x: int(np.floor(x/10) * 10))
titles[['title', 'decade']].groupby('decade').count().sort_values(by='decade')

        title
decade
1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67976
2020      210

### Count the number of "Hamlet" films made in each decade.

In [123]:
titles_hamlet = titles[titles['title'] == 'Hamlet']
titles_hamlet[['title', 'decade']].groupby('decade').count().sort_values(by='decade')

        title
decade
1910        3
1920        1
1940        1
1950        1
1960        2
1970        2
1980        1
1990        2
2000        2
2010        3

### Count the number of "Rustler" characters in each decade of the history of film.

In [129]:
cast['decade'] = cast['year'].apply(lambda x: int(np.floor(x/10) * 10))
cast.head()

,title,year,name,type,character,n,decade
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN,2010
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0,1980
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0,2010
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN,2010
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN,2010

In [133]:
cast_char_rustler = cast[cast['character'] == 'Rustler']
cast_char_rustler[['decade', 'character']].groupby('decade').count().sort_values(by='decade')

        character
decade
1920            6
1930           84
1940           18
1950            8
1960            2
1970            9
1980            1
1990            4
2000            2

### Count the number of "Hamlet" characters in each decade.

In [134]:
cast_char_hamlet = cast[cast['character'] == 'Hamlet']
cast_char_hamlet[['decade', 'character']].groupby('decade').count().sort_values(by='decade')

        character
decade
1910            6
1920            1
1930            6
1940            1
1950            3
1960            7
1970            8
1980            2
1990           11
2000           19
2010           28

### What are the 11 most common character names in movie history?

In [139]:
cast[['character', 'type']].groupby('character').count().sort_values(by='type', ascending=False).head(11)

              type
character
Himself      19600
Dancer       12096
Extra        10953
Reporter      8154
Doctor        7436
Student       7177
Policeman     6883
Party Guest   6742
Nurse         6676
Bartender     6613
Minor Role    6255

### Who are the 10 people most often credited as "Herself" in film history?

In [143]:
cast_herself = cast[cast['character'] == 'Herself']
cast_herself[['name', 'n']].groupby('name').count().sort_values(by='n', ascending=False).head(10)

                     n
name
Joyce Brothers       9
Sally Jessy Raphael  4
Katrina Kaif         3
Caroline Munro       3
Camille Paglia       3
Carmen Electra       3
Roma Torre           3
Kelly Lange          3
Celia Cruz           3
Whoopi Goldberg      3

### Who are the 10 people most often credited as "Himself" in film history?

In [144]:
cast_himself = cast[cast['character'] == 'Himself']
cast_himself[['name', 'n']].groupby('name').count().sort_values(by='n', ascending=False).head(10)

                            n
name
Ron Jeremy                 17
Kurt Loder                  9
Shaquille O'Neal            8
Bob Costas                  7
The Bishop Don Magic Juan   6
Billy Graham                6
Lloyd Kaufman               6
Ed Koch                     6
Alex Trebek                 6
Marv Albert                 6

### Which actors or actresses appeared in the most movies in the year 1945?

In [147]:
cast_1945 = cast[cast['year'] == 1945]
cast_1945[['n', 'name']].groupby('name').count().sort_values(by='n', ascending=False).head(10)

                    n
name
Addison Richards   17
Tom London         17
Charles Starrett   16
Roy Barcroft       16
Jack Ingram        15
Pierre Watkin      15
Emmett Vogan       14
Bud Geary          14
Charles (II) King  13
Ed Cassidy         12

### Which actors or actresses appeared in the most movies in the year 1985?

In [149]:
cast_1985 = cast[cast['year'] == 1985]
cast_1985[['n', 'name']].groupby('name').count().sort_values(by='n', ascending=False).head(10)

                n
name
Mammootty      22
Sukumari       18
Lou Scheimer   15
Mohanlal       15
Deven Verma    12
Raj Babbar     12
Rajesh Khanna  12
Aruna Irani    11
Shobana        10
Thilakan       10

### How many roles "Mammootty" has played in each year of his career.

In [155]:
cast_mammootty = cast[cast['name'] == 'Mammootty']
cast_mammootty[['n', 'year']].groupby('year').count().sort_values(by='n', ascending=False).head(5)

       n
year
1985  22
1986  17
1983  16
1984  16
1990  14

### What are the 10 most frequent roles that start with the phrase "Patron in"?

In [169]:
cast_chars = cast[~cast['character'].isnull()]
cast_chars_patron_in = cast_chars[cast_chars['character'].str.match('^Patron in')]
cast_chars_patron_in[['character', 'n']].groupby('character').count().sort_values(by='n', ascending=False).head(10)

                              n
character
Patron in Chinese Restaurant  9
Patron in the Coffee House    9
Patron in Billiard Parlor     5
Patron in Club                3
Patron in Quiet Bar           2
Patron in booth               2
Patron in Hooly's             1
Patron in Black               1
Patron in Bar                 1
Patron in Pool Hall           1

### What are the 10 most frequent roles that start with the word "Science"?

In [170]:
cast_chars_science = cast_chars[cast_chars['character'].str.match('^Science ')]
cast_chars_science[['character', 'n']].groupby('character').count().sort_values(by='n', ascending=False).head(10)

                      n
character
Science Teacher      41
Science Reporter      5
Science Club Member   5
Science Promo Cadet   4
Science Fair Judge    4
Science teacher       3
Science Kid           3
Science Team Member   2
Science Officer       2
Science Performer 1   1

### Count number of n-values of the roles that Judi Dench has played over her career.

In [174]:
cast_judi_dench = cast[cast['name'] == 'Judi Dench']
cast_judi_dench[['n', 'name']].groupby('n').count().sort_values(by='name', ascending=False)

      name
n
1.0      6
3.0      6
2.0      6
7.0      4
4.0      4
6.0      4
12.0     3
5.0      2
13.0     2
16.0     2
18.0     2
8.0      1
9.0      1
20.0     1
23.0     1
26.0     1
29.0     1
40.0     1

### Count number of n-values of Cary Grant's roles through his career.

In [175]:
cast_cary_grant = cast[cast['name'] == 'Cary Grant']
cast_cary_grant[['n', 'name']].groupby('n').count().sort_values(by='name', ascending=False)

      name
n
1.0     46
2.0     20
3.0      2
9.0      2
10.0     2
4.0      1
5.0      1
8.0      1

### Count number of n-value of the roles that Sidney Poitier has acted over the years.

In [176]:
cast_sidney_poitier = cast[cast['name'] == 'Sidney Poitier']
cast_sidney_poitier[['n', 'name']].groupby('n').count().sort_values(by='name', ascending=False)

      name
n
1.0     21
2.0      8
3.0      6
4.0      3
5.0      1
10.0     1
13.0     1
21.0     1

### How many leading (n=1) roles were available to actors, and how many to actresses, in the 1950s?

In [182]:
cast_leads_in_1950s = cast[
  (cast['n'] == 1) &
  (cast['year'].between(1950, 1959))]
cast_leads_in_1950s[['type', 'n']].groupby('type').count()

            n
type
actor    6616
actress  2965

### How many supporting (n=2) roles were available to actors, and how many to actresses, in the 1950s?

In [184]:
cast_supports_in_1950s = cast[
  (cast['n'] == 2) &
  (cast['year'].between(1950, 1959))]
cast_supports_in_1950s[['type', 'n']].groupby('type').count()

            n
type
actor    4564
actress  4556